slides/lecture06.org
# How to make it work with Spacemacs
# 1. Add the following to .spacemacs file
# (org :variables
#      org-enable-github-support t
#      org-enable-reveal-js-support t)
# 2. Use M-x org-reveal-export-to-html-and-browse

#+TITLE: Canonical Structures
#+DATE: 25.10.2019
#+AUTHOR: Anton Trunov (Zilliqa Research)
#+EMAIL: https://github.com/anton-trunov
#+OPTIONS: num:nil toc:nil timestamp:nil
#+REVEAL_TRANS: none
# none | fade | slide | convex | concave | zoom
#+REVEAL_THEME: beige
# default | beige | sky | night | serif | simple | moon
# /League/Sky/Beige/Simple/Serif/Blood/Night/Moon/Solarized
#+REVEAL_EXTRA_CSS: ./modifications.css

* Canonical Structures and Coercions
- Motivation: generic comparison operation
- x == y
#+BEGIN_SRC coq
  eq_op : (T : Type) -> (x y : T) -> bool

  Notation "x == y" := (eq_op _ x y).
#+END_SRC
- =eq_op= is not possible to implement in general
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
    sort : Type;
    eq_op : sort -> sort -> bool;
    spec : forall x y, eq_op x y = true <-> x = y
  }.





#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
    sort : Type;
    eq_op : sort -> sort -> bool;
    spec : forall x y, eq_op x y = true <-> x = y
  }.

  Coercion sort : eqType >-> Sortclass.



#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
    sort : Type;
    eq_op : sort -> sort -> bool;
    spec : forall x y, eq_op x y = true <-> x = y
  }.

  Coercion sort : eqType >-> Sortclass.

  Lemma eq_sym (T : eqType) (x y : T) :
    x == y -> y == x.
#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
    sort : Type;
    eq_op : sort -> sort -> bool;
    spec : forall x y, eq_op x y = true <-> x = y
  }.

  Coercion sort : eqType >-> Sortclass.

  Lemma eq_sym (T : eqType) (x y : sort T) :
    x == y -> y == x.
#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
    sort : Type;
    eq_op : sort -> sort -> bool;
    spec : forall x y, eq_op x y = true <-> x = y
  }.
#+END_SRC
#+BEGIN_SRC coq
  eq_op : forall (T : eqType),
          sort T -> sort T -> bool
#+END_SRC
* Example
initially we have
#+BEGIN_SRC coq
  1 == 2
#+END_SRC
* Example
unfold ~==~ notation
#+BEGIN_SRC coq
  eq_op _ 1 2
#+END_SRC
* Example
add types and names
#+BEGIN_SRC coq
  eq_op (?s : eqType) (1 : sort ?s) (2 : sort ?s)
#+END_SRC
* Example
add types and names
#+BEGIN_SRC coq
  eq_op (?s : eqType) (1 : sort ?s) (2 : sort ?s)
  eq_op (?s : eqType) (1 : nat)     (2 : nat)
#+END_SRC
* Example
so we need to be able to solve equations like
#+BEGIN_SRC coq
  sort (?s : eqType) = nat
#+END_SRC
- type inference is undecidable in this case
- so we need hints
* Canonical Structures to the rescue
#+BEGIN_SRC coq
Canonical nat_eqType := Pack nat eqn proof.
Print Canonical Projections.
...
nat <- sort ( nat_eqType )
...
#+END_SRC
* Example
#+BEGIN_SRC coq


  eq_op (?s : eqType) (1 : sort ?s) (2 : sort ?s)
  eq_op (?s : eqType) (1 : nat)     (2 : nat)



#+END_SRC
* Example
#+BEGIN_SRC coq
  nat <- sort ( nat_eqType )
    
  eq_op (?s : eqType) (1 : sort ?s) (2 : sort ?s)
                           |             |
                           v             v
  eq_op (?s : eqType) (1 : nat)     (2 : nat)
#+END_SRC
