slides/lecture06.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Canonical Structures</title>
<meta name="author" content="Anton Trunov (Zilliqa Research)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/beige.css" id="theme"/>

<link rel="stylesheet" href="./modifications.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Canonical Structures</h1><h2 class="author">Anton Trunov (Zilliqa Research)</h2><h2 class="date">25.10.2019</h2>
</section>

<section>
<section id="slide-org3c2e7d0">
<h2 id="org3c2e7d0">Canonical Structures and Coercions</h2>
<ul>
<li>Motivation: generic comparison operation</li>
<li>x == y</li>

</ul>
<div class="org-src-container">

<pre  class="src src-coq">eq_op : <span style="color: #4f97d7;">(</span><span style="color: #7590db;">T</span> : <span style="color: #ce537a; font-weight: bold;">Type</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">(</span><span style="color: #7590db;">x y</span> : T<span style="color: #4f97d7;">)</span> -&gt; bool

<span style="color: #4f97d7; font-weight: bold;">Notation</span> <span style="color: #2d9574;">"x == y"</span> := <span style="color: #4f97d7;">(</span>eq_op _ x y<span style="color: #4f97d7;">)</span>.
</pre>
</div>
<ul>
<li><code>eq_op</code> is not possible to implement in general</li>

</ul>
</section>
</section>
<section>
<section id="slide-org26a1bcb">
<h2 id="org26a1bcb">Solution: eqType structure</h2>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Structure</span> <span style="color: #bc6ec5; font-weight: bold;">eqType</span> := Pack <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">sort</span> : <span style="color: #ce537a; font-weight: bold;">Type</span>;
  eq_op : sort -&gt; sort -&gt; bool;
  spec : <span style="color: #ce537a; font-weight: bold;">forall</span> <span style="color: #7590db;">x y</span>, eq_op x y = true &lt;-&gt; x = y
<span style="color: #4f97d7;">}</span>.





</pre>
</div>
</section>
</section>
<section>
<section id="slide-org5806b3f">
<h2 id="org5806b3f">Solution: eqType structure</h2>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Structure</span> <span style="color: #bc6ec5; font-weight: bold;">eqType</span> := Pack <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">sort</span> : <span style="color: #ce537a; font-weight: bold;">Type</span>;
  eq_op : sort -&gt; sort -&gt; bool;
  spec : <span style="color: #ce537a; font-weight: bold;">forall</span> <span style="color: #7590db;">x y</span>, eq_op x y = true &lt;-&gt; x = y
<span style="color: #4f97d7;">}</span>.

<span style="color: #4f97d7; font-weight: bold;">Coercion</span> <span style="color: #7590db;">sort</span> : eqType &gt;-&gt; Sortclass.



</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgda61a20">
<h2 id="orgda61a20">Solution: eqType structure</h2>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Structure</span> <span style="color: #bc6ec5; font-weight: bold;">eqType</span> := Pack <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">sort</span> : <span style="color: #ce537a; font-weight: bold;">Type</span>;
  eq_op : sort -&gt; sort -&gt; bool;
  spec : <span style="color: #ce537a; font-weight: bold;">forall</span> <span style="color: #7590db;">x y</span>, eq_op x y = true &lt;-&gt; x = y
<span style="color: #4f97d7;">}</span>.

<span style="color: #4f97d7; font-weight: bold;">Coercion</span> <span style="color: #7590db;">sort</span> : eqType &gt;-&gt; Sortclass.

<span style="color: #4f97d7; font-weight: bold;">Lemma</span> <span style="color: #bc6ec5; font-weight: bold;">eq_sym</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">T</span> : eqType<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">x y</span> : T<span style="color: #4f97d7;">)</span> :
  x == y -&gt; y == x.
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org03b63c6">
<h2 id="org03b63c6">Solution: eqType structure</h2>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Structure</span> <span style="color: #bc6ec5; font-weight: bold;">eqType</span> := Pack <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">sort</span> : <span style="color: #ce537a; font-weight: bold;">Type</span>;
  eq_op : sort -&gt; sort -&gt; bool;
  spec : <span style="color: #ce537a; font-weight: bold;">forall</span> <span style="color: #7590db;">x y</span>, eq_op x y = true &lt;-&gt; x = y
<span style="color: #4f97d7;">}</span>.

<span style="color: #4f97d7; font-weight: bold;">Coercion</span> <span style="color: #7590db;">sort</span> : eqType &gt;-&gt; Sortclass.

<span style="color: #4f97d7; font-weight: bold;">Lemma</span> <span style="color: #bc6ec5; font-weight: bold;">eq_sym</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">T</span> : eqType<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">x y</span> : sort T<span style="color: #4f97d7;">)</span> :
  x == y -&gt; y == x.
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org7a3024e">
<h2 id="org7a3024e">Solution: eqType structure</h2>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #4f97d7; font-weight: bold;">Structure</span> <span style="color: #bc6ec5; font-weight: bold;">eqType</span> := Pack <span style="color: #4f97d7;">{</span>
  <span style="color: #7590db;">sort</span> : <span style="color: #ce537a; font-weight: bold;">Type</span>;
  eq_op : sort -&gt; sort -&gt; bool;
  spec : <span style="color: #ce537a; font-weight: bold;">forall</span> <span style="color: #7590db;">x y</span>, eq_op x y = true &lt;-&gt; x = y
<span style="color: #4f97d7;">}</span>.
</pre>
</div>
<div class="org-src-container">

<pre  class="src src-coq">eq_op : <span style="color: #ce537a; font-weight: bold;">forall</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">T</span> : eqType<span style="color: #4f97d7;">)</span>,
        sort T -&gt; sort T -&gt; bool
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org939d591">
<h2 id="org939d591">Example</h2>
<p>
initially we have
</p>
<div class="org-src-container">

<pre  class="src src-coq"><span style="color: #a45bad;">1</span> == <span style="color: #a45bad;">2</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge5da115">
<h2 id="orge5da115">Example</h2>
<p>
unfold <code>==</code> notation
</p>
<div class="org-src-container">

<pre  class="src src-coq">eq_op _ <span style="color: #a45bad;">1</span> <span style="color: #a45bad;">2</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb2f0abc">
<h2 id="orgb2f0abc">Example</h2>
<p>
add types and names
</p>
<div class="org-src-container">

<pre  class="src src-coq">eq_op <span style="color: #4f97d7;">(</span><span style="color: #7590db;">?s</span> : eqType<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span> : sort <span style="color: #7590db;">?s</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span> : sort <span style="color: #7590db;">?s</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org9bcef53">
<h2 id="org9bcef53">Example</h2>
<p>
add types and names
</p>
<div class="org-src-container">

<pre  class="src src-coq">eq_op <span style="color: #4f97d7;">(</span><span style="color: #7590db;">?s</span> : eqType<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span> : sort <span style="color: #7590db;">?s</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span> : sort <span style="color: #7590db;">?s</span><span style="color: #4f97d7;">)</span>
eq_op <span style="color: #4f97d7;">(</span><span style="color: #7590db;">?s</span> : eqType<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1</span> : nat<span style="color: #4f97d7;">)</span>     <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">2</span> : nat<span style="color: #4f97d7;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgc865b9a">
<h2 id="orgc865b9a">Example</h2>
<p>
so we need to be able to solve equations like
</p>
<div class="org-src-container">

<pre  class="src src-coq">sort <span style="color: #4f97d7;">(</span><span style="color: #7590db;">?s</span> : eqType<span style="color: #4f97d7;">)</span> = nat
</pre>
</div>
<ul>
<li>type inference is undecidable in this case</li>
<li>so we need hints</li>

</ul>
</section>
</section>
<section>
<section id="slide-org4953235">
<h2 id="org4953235">Canonical Structures to the rescue</h2>
<div class="org-src-container">

<pre  class="src src-coq">Canonical nat_eqType := Pack nat eqn proof.
<span style="color: #4f97d7; font-weight: bold;">Print</span> Canonical Projections.
...
nat &lt;- sort <span style="color: #4f97d7;">(</span> nat_eqType <span style="color: #4f97d7;">)</span>
...
</pre>
</div>
</section>
</section>
